<?php
// +----------------------------------------------------------------------
// | CRMEB [ CRMEB赋能开发者，助力企业发展 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2026 https://www.crmeb.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed CRMEB并不是自由软件，未经许可不能去掉CRMEB相关版权
// +----------------------------------------------------------------------
// | Author: CRMEB Team <admin@crmeb.com>
// +----------------------------------------------------------------------

/**
 * v6.0.1 升级脚本
 * 版本说明：性能优化与问题修复版本
 *
 * SQL类型说明：
 * 1: 建表
 * 2: 删表
 * 3: 添加字段
 * 4: 修改字段
 * 5: 删除字段
 * 6: 添加数据
 * 7: 修改数据
 * 8: 删除数据
 * -1: 直接执行SQL
 */

return [
    'version' => 'CRMEB-BZ v6.0.1',
    'code' => 601,
    'description' => '性能优化与问题修复版本',
    'update_sql' => [
        [
            'type' => -1,
            'table' => "store_order",
            'sql' => "ALTER TABLE `@table` MODIFY COLUMN `trade_no` varchar(100) NOT NULL DEFAULT '' COMMENT '支付订单号';"
        ],
    ]
];
